hardware-designs-iai/tiago_robotiq_adapter/firmware/tiago/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_NO_STUB=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_LOG_COLORS=n
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_ESPNOW_ALL_SECURITY=y
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_SENDING=y
CONFIG_ESPNOW_CONTROL_AUTO_CHANNEL_FORWARD=y
CONFIG_ESPNOW_AUTO_RESTORE_CHANNEL=y
CONFIG_ESPNOW_DATA_FAST_ACK=y
CONFIG_ESPNOW_STORE_HISTORY=n
